"""
На вход автоматически подаются две строки frac1 и frac2 вида a/b - дробь с числителем и знаменателем.

Напишите программу, которая должна возвращать сумму и произведение дробей.

Для проверки своего кода используйте модуль fractions.

Пример

На входе:


frac1 = "1/2"
frac2 = "1/3"
На выходе:


Сумма дробей: 5/6
Произведение дробей: 1/6
Сумма дробей: 5/6
Произведение дробей: 1/6
"""

frac1 = "1/2"
frac2 = "1/3"

temp_1 = frac1.split("/")
temp_2 = frac2.split("/")

res_1 = int(temp_1[0]) * int(temp_2[1]) + int(temp_2[0]) * int(temp_1[1])
res_2 = int(temp_1[1]) * int(temp_2[1])
print(f"Сумма дробей: {res_1}/{res_2}")
res_1 = int(temp_1[0]) * int(temp_2[0])
res_2 = int(temp_1[1]) * int(temp_2[1])
print(f"Произведение дробей: {res_1}/{res_2}")
